In [1]:
import pandas as pd

## Pandas

## Task 1: Setup and DataFrame Creation

In [2]:
# Creating DataFrame from a dictionary
dict_1 = {
    'name':['Rohit','john','priya','binita'],
    'ages':[25,45,23,28]
}
print(dict_1)

df = pd.DataFrame(dict_1)
df

{'name': ['Rohit', 'john', 'priya', 'binita'], 'ages': [25, 45, 23, 28]}

     name  ages
0   Rohit    25
1    john    45
2   priya    23
3  binita    28

In [3]:
# Creating DataFrames from a list of dictionaries
data =[{'Name':'Binita','Age':29}, {'Name':'Prabin', 'Age':30}]
print(data)

df = pd.DataFrame(data)
df

[{'Name': 'Binita', 'Age': 29}, {'Name': 'Prabin', 'Age': 30}]

     Name  Age
0  Binita   29
1  Prabin   30

In [4]:
# # Load a dataset from a CSV file
dict_2 = pd.read_csv("messed_dataset.csv")
print(dict_2)
df = pd.DataFrame(dict_2)
df

                  Name   Age                     Email            Country  \
0              invalid  59.0       ycastro@example.org        Switzerland
1      David Jefferson  21.0                       NaN              China
2        Jessica Reyes  34.0                       NaN                NaN
3    Kenneth Macdonald  68.0         ewolf@example.com              Italy
4          Julie Horne  78.0                       NaN            Ecuador
..                 ...   ...                       ...                ...
95    Garrett Davidson  56.0        gjames@example.com    Solomon Islands
96      Elizabeth Ross  52.0  richardlewis@example.net  Equatorial Guinea
97                 NaN  72.0       brian50@example.com            Somalia
98      Patricia Singh  65.0      lramirez@example.org             Greece
99  Christopher Stokes  42.0                       NaN       South Africa

      Salary DateOfJoining
0   44694.24    2022-09-29
1        NaN    2021-10-04
2   60511.62    2022-05-24
3   84223.29    2022-04-07
4   24665.13    2020-06-19
..       ...           ...
95  86227.88           NaN
96  29992.69    2020-04-08
97  90628.22    2020-04-11
98  85290.44    2020-03-18
99  20289.17    2021-09-23

[100 rows x 6 columns]

,Name,Age,Email,Country,Salary,DateOfJoining
0,invalid,59.0,ycastro@example.org,Switzerland,44694.24,2022-09-29
1,David Jefferson,21.0,NaN,China,NaN,2021-10-04
2,Jessica Reyes,34.0,NaN,NaN,60511.62,2022-05-24
3,Kenneth Macdonald,68.0,ewolf@example.com,Italy,84223.29,2022-04-07
4,Julie Horne,78.0,NaN,Ecuador,24665.13,2020-06-19
...,...,...,...,...,...,...
95,Garrett Davidson,56.0,gjames@example.com,Solomon Islands,86227.88,NaN
96,Elizabeth Ross,52.0,richardlewis@example.net,Equatorial Guinea,29992.69,2020-04-08
97,NaN,72.0,brian50@example.com,Somalia,90628.22,2020-04-11
98,Patricia Singh,65.0,lramirez@example.org,Greece,85290.44,2020-03-18
99,Christopher Stokes,42.0,NaN,South Africa,20289.17,2021-09-23

## Task 2: Viewing and Inspecting Data

In [5]:
 # Display the first few rows of the DataFrame.(By default give first 5 rows)
print(dict_2.head())
print(dict_2.head(2)) # first two ros is displayed

                Name   Age                Email      Country    Salary  \
0            invalid  59.0  ycastro@example.org  Switzerland  44694.24
1    David Jefferson  21.0                  NaN        China       NaN
2      Jessica Reyes  34.0                  NaN          NaN  60511.62
3  Kenneth Macdonald  68.0    ewolf@example.com        Italy  84223.29
4        Julie Horne  78.0                  NaN      Ecuador  24665.13

  DateOfJoining
0    2022-09-29
1    2021-10-04
2    2022-05-24
3    2022-04-07
4    2020-06-19
              Name   Age                Email      Country    Salary  \
0          invalid  59.0  ycastro@example.org  Switzerland  44694.24
1  David Jefferson  21.0                  NaN        China       NaN

  DateOfJoining
0    2022-09-29
1    2021-10-04

In [6]:
#  Display the last few rows of the DataFrame
print(dict_2.tail())
print(dict_2.tail(5)) # last 7 rows in displayed

                  Name   Age                     Email            Country  \
95    Garrett Davidson  56.0        gjames@example.com    Solomon Islands
96      Elizabeth Ross  52.0  richardlewis@example.net  Equatorial Guinea
97                 NaN  72.0       brian50@example.com            Somalia
98      Patricia Singh  65.0      lramirez@example.org             Greece
99  Christopher Stokes  42.0                       NaN       South Africa

      Salary DateOfJoining
95  86227.88           NaN
96  29992.69    2020-04-08
97  90628.22    2020-04-11
98  85290.44    2020-03-18
99  20289.17    2021-09-23
                  Name   Age                     Email            Country  \
95    Garrett Davidson  56.0        gjames@example.com    Solomon Islands
96      Elizabeth Ross  52.0  richardlewis@example.net  Equatorial Guinea
97                 NaN  72.0       brian50@example.com            Somalia
98      Patricia Singh  65.0      lramirez@example.org             Greece
99  Christopher Stokes  42.0                       NaN       South Africa

      Salary DateOfJoining
95  86227.88           NaN
96  29992.69    2020-04-08
97  90628.22    2020-04-11
98  85290.44    2020-03-18
99  20289.17    2021-09-23

In [7]:
 # Get a summary of the DataFrame
print(dict_2.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           89 non-null     object
 1   Age            97 non-null     object
 2   Email          80 non-null     object
 3   Country        86 non-null     object
 4   Salary         94 non-null     object
 5   DateOfJoining  79 non-null     object
dtypes: object(6)
memory usage: 4.8+ KB
None

In [8]:
# Describe the summary statistics of the data(Decsibe only the integer value)
dict_2.describe()

           Name   Age                Email Country   Salary DateOfJoining
count        89    97                   80      86       94            79
unique       85    53                   80      76       93            79
top     invalid  76.0  ycastro@example.org   China  invalid    2022-09-29
freq          5     6                    1       2        2             1

In [9]:
# Display the shape and column names of the DataFrame.
print(dict_2.shape)

(100, 6)

In [10]:
print(dict_2.columns)

Index(['Name', 'Age', 'Email', 'Country', 'Salary', 'DateOfJoining'], dtype='object')

## Task 3: Selection and Indexing

In [11]:
# selecting single columns
dict_2['Age']

0     59.0
1     21.0
2     34.0
3     68.0
4     78.0
      ...
95    56.0
96    52.0
97    72.0
98    65.0
99    42.0
Name: Age, Length: 100, dtype: object

In [12]:
# Selecting Multiple Columns
print(dict_2[["Name", "Age"]])

                  Name   Age
0              invalid  59.0
1      David Jefferson  21.0
2        Jessica Reyes  34.0
3    Kenneth Macdonald  68.0
4          Julie Horne  78.0
..                 ...   ...
95    Garrett Davidson  56.0
96      Elizabeth Ross  52.0
97                 NaN  72.0
98      Patricia Singh  65.0
99  Christopher Stokes  42.0

[100 rows x 2 columns]

In [13]:
#selecting rows by index
dict_2.iloc[0]

Name                         invalid
Age                             59.0
Email            ycastro@example.org
Country                  Switzerland
Salary                      44694.24
DateOfJoining             2022-09-29
Name: 0, dtype: object

In [14]:
# Selecting the first two rows by Index
dict_2.iloc[1:3]

              Name   Age Email Country    Salary DateOfJoining
1  David Jefferson  21.0   NaN   China       NaN    2021-10-04
2    Jessica Reyes  34.0   NaN     NaN  60511.62    2022-05-24

In [15]:
#selecting rows and columns by labels
dict_2.loc[1, 'Name']

'David Jefferson'

In [16]:
# selecting first 3 rows for the given columns
dict_2.loc[:3, "Name"]

0              invalid
1      David Jefferson
2        Jessica Reyes
3    Kenneth Macdonald
Name: Name, dtype: object

## Task 4: Handling Missing Data

In [17]:
#Identify missing values in the DataFrame.
dict_2.isnull().sum()

Name             11
Age               3
Email            20
Country          14
Salary            6
DateOfJoining    21
dtype: int64

In [18]:
#Drop rows with missing values
dict_2.dropna(inplace=True)
print(dict_2.isnull().sum())

Name             0
Age              0
Email            0
Country          0
Salary           0
DateOfJoining    0
dtype: int64

In [19]:
#Fill missing values with a specified value.
df.fillna(value = {"Age":0}, inplace = True)

## Task 5: Data Operations

In [20]:
#Add a new column to the DataFrame.
dict_1['Income'] = [5000, 2000]

In [21]:
# Delete a column from the DataFrame.
df.drop(columns= ['Age'], inplace = True)

In [22]:
#Rename columns from the DataFrame.
dict_2.rename(columns= {"Name":"Fisrt_Name"}, inplace=True)
print(dict_2)

                Fisrt_Name      Age                        Email  \
0                  invalid     59.0          ycastro@example.org
3        Kenneth Macdonald     68.0            ewolf@example.com
5         Jonathan Holland     26.0     mayercaitlin@example.org
7         Kimberly Roberts     76.0          lmiller@example.org
9              Jason Perez     59.0    collinsedward@example.com
10           Olivia Strong     76.0  schultzpatricia@example.com
13          Jessica Rivera     73.0        fmitchell@example.net
15           Lauren Becker     30.0    watsonjeffrey@example.net
20           Dylan Simpson     46.0        jessica74@example.net
23              Karen Ward     56.0         daniel47@example.com
24              Amy Henson     80.0       tylerwatts@example.org
28           Ricardo Moody     76.0         xmorales@example.net
29          Stephanie Moss     61.0         qvaughan@example.com
35           Rebecca Davis     35.0  wallacejennifer@example.net
36         Keith Velazquez     22.0        charles82@example.net
37      Christopher Martin     40.0           tina11@example.com
40                 invalid     64.0         mjackson@example.org
43             James Davis  invalid         teresa22@example.com
44            Brandi White     35.0            mhall@example.net
49           Amber Mendoza     64.0        qrobinson@example.com
51          Whitney Graham     40.0       zrodriguez@example.org
52       Patrick Brown PhD     44.0          james16@example.net
58  Dr. Olivia Caldwell MD     76.0   hernandezjason@example.com
59             Diane Smith     57.0          david44@example.net
60          Thomas Navarro     50.0          psnyder@example.org
61          Terri Phillips     27.0     garyanderson@example.net
64           Andrew Bryant     43.0      jacobtorres@example.com
68           Justin Wright     29.0    elizabethreid@example.org
69        Michael Oconnell     19.0        fdelacruz@example.org
70        Christina Garcia     40.0        kathryn18@example.org
72            Morgan Brown     79.0           wsmith@example.org
73          Mitchell Smith     32.0          spierce@example.com
74          Whitney Garcia     70.0      tylergolden@example.com
78         Tabitha Delgado     74.0    lancewilliams@example.net
80            David Walker     43.0          linda84@example.net
81             Brandi Long     45.0            vford@example.com
82         Kristi Calderon     80.0         sharon04@example.com
83            Kendra Mason     47.0      megancarter@example.com
84           Debbie Romero     58.0      nathaniel61@example.net
85     Elizabeth Wilkinson     66.0     gailmcdonald@example.org
86           David Randall     74.0           cody30@example.net
87             Nancy Irwin     42.0      juliaweaver@example.net
88             Joel Martin     76.0        bjacobson@example.com
89            Lauren Jones     68.0      melissadyer@example.com
91          Ryan Middleton     42.0  mcconnellashley@example.net
92            Seth Bradley     76.0       melissakim@example.org
93           Alicia Miller     59.0         thomas45@example.net
94            Cody Jackson     48.0       jamieayers@example.net
96          Elizabeth Ross     52.0     richardlewis@example.net
98          Patricia Singh     65.0         lramirez@example.org

                                              Country    Salary DateOfJoining
0                                         Switzerland  44694.24    2022-09-29
3                                               Italy  84223.29    2022-04-07
5                                            Cameroon  25660.99    2023-05-01
7                                         Netherlands  58550.56    2023-07-08
9                                             Myanmar  20175.11    2024-04-11
10                                       South Africa  72362.02    2023-07-27
13                           Central African Republic  71261.36    2021-05-18
15                                              Malta   invalid    2020-01-13
20                                             Serbia   59670.5    2021-10-31
23                                              Congo   83580.8    2022-04-09
24                             Bosnia and Herzegovina  35390.77    2023-12-11
28                                            Bahrain  83514.58    2024-03-29
29                                           Guernsey  35671.38    2021-11-22
35                                          Sri Lanka  66871.64    2022-08-06
36                                       Burkina Faso  81661.97    2024-03-27
37                               Netherlands Antilles  81367.57    2020-07-30
40  British Indian Ocean Territory (Chagos Archipe...   25219.6    2024-02-14
43                                          Mauritius   54801.7    2021-07-15
44                                           Tanzania  21408.87    2020-11-26
49                                             Uganda  47293.85    2021-05-27
51                                         Mozambique  98826.59    2023-05-08
52                                             Greece   83842.6    2020-07-12
58                                        Philippines  78453.84    2023-07-19
59                                   Saint Barthelemy  86579.95    2020-07-27
60                           Turks and Caicos Islands  86286.69    2020-11-03
61                                           Cambodia  47755.97       invalid
64                                           Colombia  32205.53    2020-10-26
68                                        Timor-Leste  28951.24    2020-02-21
69                                            Grenada  62929.05    2022-01-21
70                                            invalid  73916.51    2023-11-13
72                                         Cape Verde  28583.22    2021-03-12
73                                            Armenia  57795.75    2021-04-19
74                               Netherlands Antilles  68794.39    2022-07-23
78                                              Sudan  98396.21    2022-04-03
80                                      Guinea-Bissau  89683.17    2021-06-20
81                                            Ecuador  30773.53    2020-06-29
82                                            Iceland  99507.66    2022-07-09
83                                            Moldova  34369.87    2023-07-09
84                                            Reunion  39875.14    2023-02-11
85                                       Turkmenistan  69624.01    2023-05-19
86                                               Niue  43013.14    2024-05-24
87                                     Czech Republic   29455.0    2020-07-21
88                                              Korea   invalid    2022-05-23
89                                             Malawi  42435.96    2020-06-12
91                                            Bahamas  78048.75    2021-04-05
92                         Slovakia (Slovak Republic)  49354.13    2021-08-01
93                                         Mauritania  52834.29    2020-06-03
94                                         Luxembourg  55583.62    2021-05-23
96                                  Equatorial Guinea  29992.69    2020-04-08
98                                             Greece  85290.44    2020-03-18

In [23]:
#Apply a function to a column.
#Add  dependent to all
dict_2['Age'] = dict_2['Age'].apply(lambda x: x + '1')
print(df)

                  Name                     Email            Country    Salary  \
0              invalid       ycastro@example.org        Switzerland  44694.24
1      David Jefferson                       NaN              China       NaN
2        Jessica Reyes                       NaN                NaN  60511.62
3    Kenneth Macdonald         ewolf@example.com              Italy  84223.29
4          Julie Horne                       NaN            Ecuador  24665.13
..                 ...                       ...                ...       ...
95    Garrett Davidson        gjames@example.com    Solomon Islands  86227.88
96      Elizabeth Ross  richardlewis@example.net  Equatorial Guinea  29992.69
97                 NaN       brian50@example.com            Somalia  90628.22
98      Patricia Singh      lramirez@example.org             Greece  85290.44
99  Christopher Stokes                       NaN       South Africa  20289.17

   DateOfJoining
0     2022-09-29
1     2021-10-04
2     2022-05-24
3     2022-04-07
4     2020-06-19
..           ...
95           NaN
96    2020-04-08
97    2020-04-11
98    2020-03-18
99    2021-09-23

[100 rows x 5 columns]

## Task 6: GroupBy Operations

In [24]:
# Group the DataFrame by a column 
data = {"Name":['Binita','Joh','Hello','Sriya'],
        "Age": [23,24,25,26],
        "Address":['Nepal', 'Australia','USA','Germany']
        }
df = pd.DataFrame(data)
df

     Name  Age    Address
0  Binita   23      Nepal
1     Joh   24  Australia
2   Hello   25        USA
3   Sriya   26    Germany

In [25]:
#Iterate over groups and display the group names and data.
grouped = df.groupby('Name')
grouped

In [26]:
#calculate summary statistics.
mean_age= grouped['Age'].mean()
mean_age

Name
Binita    23.0
Hello     25.0
Joh       24.0
Sriya     26.0
Name: Age, dtype: float64

## Task 7: Merging and Joining DataFrames

In [27]:
#Merge two DataFrames on a common column.
df1 = pd.DataFrame({'A':['A0','A1','A2'],
                   'B':['B1','B2','B3']
                   }, index = ['K0','K1','K2'])
df1

     A   B
K0  A0  B1
K1  A1  B2
K2  A2  B3

In [28]:
df2 = pd.DataFrame({'C':['C0','C1','C2'],
                   'D':['D1','D2','D3']
                   }, index = ['H0','H1','H2'])
df2

     C   D
H0  C0  D1
H1  C1  D2
H2  C2  D3

In [29]:
#Join two DataFrames using their indices.
joined_df = df1.join(df2)
joined_df

     A   B    C    D
K0  A0  B1  NaN  NaN
K1  A1  B2  NaN  NaN
K2  A2  B3  NaN  NaN

## Task 8: Working with Dates and Times

In [32]:
#Create a datetime index for the DataFrame.
df["Date"] = pd.date_range(start='1/1/2024', periods=len(df), freq="D")
print(df)

     Name  Age    Address       Date
0  Binita   23      Nepal 2024-01-01
1     Joh   24  Australia 2024-01-02
2   Hello   25        USA 2024-01-03
3   Sriya   26    Germany 2024-01-04

In [33]:
#Convert a column to datetime 
df["Date"] = pd.to_datetime(df["Date"])
print(df)

     Name  Age    Address       Date
0  Binita   23      Nepal 2024-01-01
1     Joh   24  Australia 2024-01-02
2   Hello   25        USA 2024-01-03
3   Sriya   26    Germany 2024-01-04

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     4 non-null      object
 1   Age      4 non-null      int64
 2   Address  4 non-null      object
 3   Date     4 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 256.0+ bytes

In [38]:
# extract date components.
df['Year'] = df['Date'].dt.year
df['Month'] = df['Date'].dt.month
df['Day'] = df['Date'].dt.day
df

     Name  Age    Address       Date  Year  Month  Day
0  Binita   23      Nepal 2024-01-01  2024      1    1
1     Joh   24  Australia 2024-01-02  2024      1    2
2   Hello   25        USA 2024-01-03  2024      1    3
3   Sriya   26    Germany 2024-01-04  2024      1    4

## Task 9: Input and Output

In [39]:
#Write the DataFrame to a CSV file.
df.to_csv('sample.csv', index = False)

In [51]:
 # Read data from an Excel file.
# read_excel = pd.read_excel("SaleData.xlsx")
# excel_to_df = pd.DataFrame(read_excel)
# print(excel_to_df)

## Task 10: Visualization

In [ ]:
#Create a simple plot using Matplotlib.

In [ ]:
#Create a bar plot using Seaborn.